In [1]:
import pandas as pd

In [2]:
temp_df = pd.read_csv('Resources/temperatures.csv')
energy_df = pd.read_csv('Resources/energy_data.csv')
pop_df = pd.read_csv('Resources/populations.csv')

In [3]:
# rename the weather variables
temp_df.rename(columns={"TAVG": "Temperature"})

      Year  Month    State  Temperature
0     2000      1  Alabama       47.156
1     2000      2  Alabama       52.332
2     2000      3  Alabama       58.888
3     2000      4  Alabama       60.844
4     2000      5  Alabama       74.008
...    ...    ...      ...          ...
6727  2010      8  Wyoming       66.400
6728  2010      9  Wyoming       57.408
6729  2010     10  Wyoming       48.600
6730  2010     11  Wyoming       29.116
6731  2010     12  Wyoming       24.188

[6732 rows x 4 columns]

In [4]:
temp_df.head()

   Year  Month    State    TAVG
0  2000      1  Alabama  47.156
1  2000      2  Alabama  52.332
2  2000      3  Alabama  58.888
3  2000      4  Alabama  60.844
4  2000      5  Alabama  74.008

In [5]:
temp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6732 entries, 0 to 6731
Data columns (total 4 columns):
Year     6732 non-null int64
Month    6732 non-null int64
State    6732 non-null object
TAVG     6732 non-null float64
dtypes: float64(1), int64(2), object(1)
memory usage: 210.5+ KB

In [6]:
energy_df.head()

   Year  Month       State   Consumption
0  2001      1     Alabama  6.414051e+10
1  2001      1      Alaska  5.692772e+09
2  2001      1     Arizona  4.213304e+10
3  2001      1    Arkansas  2.796406e+10
4  2001      1  California  1.047889e+11

In [7]:
energy_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4284 entries, 0 to 4283
Data columns (total 4 columns):
Year           4284 non-null int64
Month          4284 non-null int64
State          4284 non-null object
Consumption    4284 non-null float64
dtypes: float64(1), int64(2), object(1)
memory usage: 134.0+ KB

In [8]:
pop_df.head()

   Year    State  Population
0  2000  Alabama     4452173
1  2001  Alabama     4467634
2  2002  Alabama     4480089
3  2003  Alabama     4503491
4  2004  Alabama     4530729

In [9]:
pop_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 561 entries, 0 to 560
Data columns (total 3 columns):
Year          561 non-null int64
State         561 non-null object
Population    561 non-null int64
dtypes: int64(2), object(1)
memory usage: 13.3+ KB

In [10]:
combined_df = temp_df.merge(pop_df, on=['Year', 'State'])
combined_df.head()

   Year  Month    State    TAVG  Population
0  2000      1  Alabama  47.156     4452173
1  2000      2  Alabama  52.332     4452173
2  2000      3  Alabama  58.888     4452173
3  2000      4  Alabama  60.844     4452173
4  2000      5  Alabama  74.008     4452173

In [11]:
combined_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6732 entries, 0 to 6731
Data columns (total 5 columns):
Year          6732 non-null int64
Month         6732 non-null int64
State         6732 non-null object
TAVG          6732 non-null float64
Population    6732 non-null int64
dtypes: float64(1), int64(3), object(1)
memory usage: 315.6+ KB

In [12]:
combined_df = combined_df.merge(energy_df, on=['Year', 'State', 'Month'])
combined_df.head()

   Year  Month    State    TAVG  Population   Consumption
0  2001      1  Alabama  41.736     4467634  6.414051e+10
1  2001      2  Alabama  52.996     4467634  5.507025e+10
2  2001      3  Alabama  52.004     4467634  5.705739e+10
3  2001      4  Alabama  64.964     4467634  4.786033e+10
4  2001      5  Alabama  71.092     4467634  6.004433e+10

In [13]:
combined_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4284 entries, 0 to 4283
Data columns (total 6 columns):
Year           4284 non-null int64
Month          4284 non-null int64
State          4284 non-null object
TAVG           4284 non-null float64
Population     4284 non-null int64
Consumption    4284 non-null float64
dtypes: float64(2), int64(3), object(1)
memory usage: 234.3+ KB

In [14]:
combined_df.to_csv('Resources/combined_data.csv', index=False)